           IDENTIFICATION DIVISION.
           PROGRAM-ID. CAIXA-ELETRONICO.
           AUTHOR. LUIZ LAMIM

           ENVIRONMENT DIVISION.
           CONFIGURATION SECTION.
           SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.