       IDENTIFICATION DIVISION.
       PROGRAM-ID. CAIXA-ELETRONICO.
       AUTHOR. LUIZ LAMIM

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
       DECIMAL-POINT IS COMMA.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-CLIENTE.
           05 WS-NOME          PIC X(30) VALUE "JOAO DA SILVA".
           05 WS-SALDO         PIC 9(06)V99 VALUE 1000,00.
           05 WS-SALDO-TELA    PIC ZZZ.ZZ9,99.
           
       01  WS-OPERACAO-VAR.
           05 WS-VALOR-INPUT   PIC 9(06)V99 VALUE ZERO.
           05 WS-VALOR-TELA    PIC ZZZ.ZZ9,99.
           05 WS-OPCAO         PIC X VALUE SPACES.
           05 WS-MENSAGEM      PIC X(40) VALUE SPACES    