       IDENTIFICATION DIVISION.
       PROGRAM-ID. SISTEMA-PAGAMENTOS.
       AUTHOR. Luiz Lamim

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.