       IDENTIFICATION DIVISION.
       PROGRAM-ID. SISTEMA-PAGAMENTOS.
       AUTHOR. Luiz Lamim

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 DADOS-PAGAMENTO.
          05 ID-CLIENTE      PIC 9(05).
          05 VALOR-BRUTO     PIC 9(07)V99.
          05 TIPO-PAGAMENTO  PIC X(01). *> 'A' = A vista, 'P' = Parcelado
          05 VALOR-FINAL     PIC 9(07)V99.
          05 DESCONTO        PIC 9(05)V99.