IDENTIFICATION DIVISION.
       PROGRAM-ID. SAT-MONITOR.
       AUTHOR. CLI
       DATE-WRITTEN. 2026-06-18.
      *----------------------------------------------------------------*
      * PROGRAMA QUE SIMULA O PROCESSAMENTO DE DADOS DE TELEMETRIA      *
      * DE UM SATÉLITE EM ÓRBITA.                                      *
      *----------------------------------------------------------------*

      ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.

       DATA DIVISION.
       WORKING-STORAGE SECTION.